[{"title":"I2C模拟总结","date":"2017-03-15T01:22:25.000Z","path":"2017/03/15/I2C模拟总结/","text":"#纯IO模拟I2C从机设备硬件平台：义隆仿真–em78p173n 一般IO模拟有2种方法：中断或查询。这里用的是查询的方式。查询IO口状态变化，主机SCK速率不能超过30K。SDA 设置IO控制寄存器为输入模式 I2C协议中最重要的一点是I2C地址。这个地址有7位和10位两种形式。7位能够表示127个地址，而在实际使用中基本上不会挂载如此多的设置，所以很多设备的地址都采用7位，所以本文接下来的说明都是基于此。I2C还有一个很重要的概念，就是“主—从”。对于从设备来说，它是啥都不干的，更不会自动发送数据；而主设备，则是起到控制作用，一切都是从它开始。 先看I2C协议 接口结构 ： 加上拉电阻到正电源。连接到总线的器件其输出级必须是低有效的开漏或开集电极结构以实现“线与”功能，连接到总线上可被寻址的器件必须具有唯一地址。 总线空闲： 保持高电平 起始条件： 当SCL为高电平时，SDA的一个下降沿定义为启始条件（S）。所有信息传输必须以启始条件开始。所有接收到启始条件的器件必须复位它们的总线逻辑。停止条件：当SCL为高电平时，SDA的一个上升沿定义为停止条件（P）。所有信息传输必须以停止条件结束。所有接收到停止条件的器件必须复位它们的总线逻辑和接口状态，主器件在产生停止条件后将释放总线。 主器件 ： 产生启始条件和串行时钟信号的器件称为主器件（或主机）。启始条件、重复启始条件、停止条件、串行时钟信号只能由主机产生。 寻址 ： 主机使用地址查找目标器件的过程。 从器件： 被主机寻址的器件称为从器件（或从机）。主机可寻址一个或多个从机，被寻址的从机可参与或不参与数据传输。 字节格式： 发送到SDA线上的每个字节必须为8位，每个字节的最高位（MSB）先发送。每次传输可以发送的字节数量不受限制。 控制码 ： 由主机发送，用于寻址、配置或控制从机的信息称为控制码。根据总线模式的不同，控制码可有一个或多个“控制字节”。控制字节可按属性命名，如主机码、从机码、方向码，或者按字节次序分别命名，如第n个字节的控制码称为“第n控制码”。包含数据方向位的控制字节称为“方向码”，协议规定方向码的最低位（LSB）为数据方向位（R/W）。数据方向位的值取决于主机是发送还是接收数据。若是发送，则该位为W，表示向总线写数据，其值为0；若是接收，则该位为R，表示从总线读数据，其值为1。 应答信号 ： 发送到SDA线上的每个字节后面必须跟一个应答信号(1)。应答信号总是由接收当前字节的器件产生。一个应答信号占用一个时钟脉冲，在应答时钟脉冲高电平期间，发送字节的器件必须释放SDA线，而接收当前字节的器件应保持SDA线为稳定的电平——低电平表示“正态应答ACK”，高电平表示“反态应答NACK” 位传输： 每传输一位信息就产生一个时钟脉冲。SDA只能在时钟低电平期间改变状态，在时钟高电平期间必须保持稳定。每个时钟脉冲包含两个边沿，下降沿在前，上升沿在后。在位传输过程中，接口总是在时钟脉冲的下降沿写入SDA，而在时钟脉冲的上升沿读取SDA。I2C总线事件（如地址识别、中断产生）总是发生在时钟脉冲的下降沿。 数据有效性： I2C总线进行数据传送时，时钟信号为高电平期间，数据线上的数据必须保持稳定，只有在时钟线上的信号为低电平期间，数据线上的高电平或低电平状态才允许变化。 SCL是时钟，SDA承载的是数据。当SDA从1变动到0，而SCL还是1时，表示开始数据传输。接下来的7位，就是设备的地址。紧接着的是读写标志，其为1时是读取，为0则是写。如果I2C总线上存在着和请求的地址相对应的设备，则从设备会发送一个ACK信号通知主设备，可以发送数据了。接到ACK信号后，主设备则发送一个8位的数据。当传输完毕之后，SCL保持为1，SDA从0变换到1时，标明传输结束。 观看时序图总结一下几点： 时序图都是共用一个时钟信号，注意时钟信号在上下图中的对应。 时序图中有叉或者上升下降的如果是数据线的话表示数据有变化。菱形封闭的一段表示有效数据。 数据需要一段时间稳定，一般在数据变化后，时钟的上升沿或者下降沿读入数据或者写入数据。","tags":[{"name":"嵌入式","slug":"嵌入式","permalink":"http://zf123.win/tags/嵌入式/"},{"name":"技术","slug":"技术","permalink":"http://zf123.win/tags/技术/"}]},{"title":"如何高效的学习","date":"2016-11-08T00:32:12.000Z","path":"2016/11/08/如何高效的学习/","text":"你连“高效学习”都不会，如何改变自己 转：2016-11-06 迎刃 LinkedIn 有一天，有个读者留言问：为什么看了你很多文章，也学习了其他资料书籍，花费很多时间，也很努力，却没有改变？ 碰到这样的问题，我其实已经见怪不怪了，然后熟练地输入一大堆反问： 你看完文章、资料、书籍后，有做笔记、总结吗？你花费的很多时间，具体有多少？你所谓的努力，努力到了什么程度？天天废寝忘食吗？你是否有根据文章资料里提到的方法，去实践过？实践的次数有多少？结果如何，是否有总结反馈和别人交流等等？ 过了一会，对方回复到：只是看，没怎么总结和实践，但我看花了很多时间。果然又是一个，自以为很努力，却是无效努力的骚年。然后又问对方，你多大？ 读者回：20岁，刚大三，我好怕，很多同学朋友都比我厉害，我怕再不努力就来不及了。总是这样努力没有结果，但又不想颓废，每次重新努力又坚持不了多久，就放弃了。 作为一个30多岁的大叔，我想对你说：你才20岁啊，为什么害怕来不及？究竟是哪里来不及呢？ 于是就有了这篇文章，来讲讲如何高效的努力学习，快速获得成长。以下方法都是我自己亲身经历过，所以感同身受，我相信，我能帮助你们改变。 1.学习成长的路径原理 人要想努力学习获得成果，首先需要了解，学习成长的路径原理是怎么样的。 很多人错以为自己的时间精力投入，可以换来直接的成果，以为努力与时间是成正比的。参考下图： 举例，我有个朋友是做服饰造型搭配的专家。帮助在非常缺乏审美的朋友，提升时尚感，让他们穿衣更有品味，外形更吸引人。刚开始他也做一些在线培训课程，教那些宅男们如何穿衣搭配。 但很多人有个狭隘的观念：以为穿衣打扮是件很容易的事情，只要自己看一遍理论方法，自己就可以搞定了。 实际上很多人学完后，自己尝试去搭配买衣服，穿出来的效果还是欠佳。于是就容易怪罪老师教得不好，学了没效果。 素不知，我那个专家朋友，为了能熟练的教别人，自己首先就花了几万元投资，去学习各种形象造型的高级课程，自己作为买手，买过的衣服估计也有几千套，以及平常关注大量的时尚杂志，节目等。同时，还有长达几年下来的咨询培训经验的积累。 他之所以能教人，就在于他在这方面不光投入了时间学习，他还有多项实践经验的累积，和不断的试错，矫正的过程。 而一般的学员，只看到了老师呈现出来的教学内容，却忽略了老师也是经历过大量的训练，才有现在的专业度。如果学员在学完理论后，没有进行大量实践，效果自然不明显。 学习成长曲线图，如下： 很多人都在“缓慢开始区”尝试了一小段时间，发现没什么变化就放弃了，于是又换了很多其他方法，也一样。无论他换任何方法技巧，即使所谓的速成的方法，都要经历这样的学习过程，才能发生改变。 他们不能看到马上努力后的效果，担心无法实现、白费力，索性就放弃了。心智不成熟的人，不懂得“推迟满足感”，他们想要的是“即时满足感”，也就是急功近利心态的表现。 然后有小部分的人，在进入到“加速提高区”，他们获得了一定的成果，但离非常牛逼的状态还有一段距离。极少数人，经历了非同寻常的磨练，或是更长时间的积累，才突破进入高原区。 我这里申明一下，这个原理就是我通过去学习别人的研究成果，以及结合自己的学习经历，得出的经验总结。 （以上的理论，引用自维基百科，李笑来、采铜等人的资料书籍文章。） 2.如何消除“我不会”的焦虑感 由于很多人不了解，我前面说的学习成长路径理论。他们想努力，却因为缺乏刻意训练，没有产生成果而感到失望，进而产生焦虑感。 焦虑是某种压力的体现。压力有阈值大小之分，未超过一定的临界点，就会形成动力，超过就会形成逃避。 这也就是为什么，有些人遇到压力能解决问题，有些人则不行，因为每个人的压力阈值点不一样，抗压力程度不一样。 压力过大有3个原因： 能力不匹配工作量大拖延习惯 这样会综合发生作用。 一个人一开始定了一个不切实际，超越自身能力的目标。比如有个粉丝说，我想通过天天写原创文章，来练习自己的写作能力。说实话天天写原创，并且言之有物，还能被别人认可，对一个新手来说是非常难的。 而一旦有一天没实现，就会出现累积崩溃，就会接连几天都提不起笔。最后这个事情就会不了了之。 所以，努力也请量力而行，定一个自己能承受一定压力的目标，循序渐进的完成，才能保证你的刻意练习能产生效果。 3.参考游戏模式，制造反馈机制 很多人为什么看一小时课本会感到很难受，精神涣散；而玩一小时游戏却精神抖擞，兴奋异常。 最大的区别就在于，看书不是一个可以让你马上产生收获和反馈的行为，而游戏则可以。因为游戏设计者就是通过让游戏更好玩，让你不停的接受信息和处理信息，让你大脑处于兴奋状态。 例如，酷炫华丽的招式，热血的背景音乐，以及你打怪升级过程中获得的金钱、经验、装备等收获，综合下来，就会让你乐于不停的游戏。 我们完全可以借鉴游戏的机制，运用在我们的学习中。 每学完一段时间，或一段内容，就给自己一个奖赏激励反馈，以及信息记录。 奖赏激励可以让你马上产生反馈和收获感、愉悦感、甚至多巴胺，借此来“欺骗”大脑，认为学习其实是件很开心的事情，人的本性是唯乐原则，开心就会激励你不断重复这件事。 而信息记录的好处，就是当你每次都做出的学习形成一个进度表格，每隔一段时间回顾总结。 例如一个月为测量单位，你就会发现，原来自己一个月下来竟然读了10本书，写了20篇文章，做过20份报告等等。 这样的记录，就类似与每次游戏过关的分数总结，也会容易让你形成，成就感，激励你不断做下去。 4.使用正确的方法，人人都有意志力 引用《自控力》: 有些专家认为，虽然人只有一个大脑，却有两个自我。一个自我任意妄为、及时行乐，另一个自我则克服冲动、深谋远虑。 我们总是在两者之间摇摆不定，有时觉得自己想减肥，有时觉得自己不吃个烧烤宵夜，就睡不着。 因此，我们可以这样来定义意志力的挑战——你一方面想要这个，一方面想要那个。两个自我发生分歧的时候，总会有一方击败另一方。决定放弃的一方并没有做错，只是双方觉得重要的东西不同而已。 那怎么提高意志力呢？每当冲动的你要击败自控的你时，就去想想什么事情可以延迟这个冲动。 例如： 你正在戒烟，但又有了抽烟的冲动，让自己有其他替代品；你如果下班时就换好了运动服，是不是就可以直接去健身房，而不是回家；你想要减肥，控制饮食，但你没有储备好，即好吃有饱腹，但又低热量的食物，就很容易因为饿了失控多吃了食物。 但还有一个简单提升意志力的方法。那就是冥想，5分钟即可。 在冥想训练中，目标就是专注呼吸。冥想不是让你什么都不想，而是让你不要太分心，不要忘了最初的目标。如果你在冥想时没法集中注意力，别担心。你只需多做练习，将注意力重新集中到呼吸上。 每当冥想结束，你就会感到精神变好，注意力也更集中，也更有控制力。","tags":[{"name":"学习","slug":"学习","permalink":"http://zf123.win/tags/学习/"}]},{"title":"英语学习","date":"2016-11-05T02:40:02.000Z","path":"2016/11/05/英语学习/","text":"賴世雄主講－如何學好英文态度： 1.善用零星时间 2.少就是多，慢就是快 3.持之以恒，永不放弃学习： 1.发音 2.会话：角色扮演 3.大量的阅、读","tags":[]},{"title":"hello","date":"2016-10-31T11:54:23.000Z","path":"2016/10/31/hello/","text":"","tags":[]}]